{
  "gitLessons": [
    {
      "LessonTitle": "Введение в Git",
      "Steps": [
        {
          "StepNumber": 1,
          "Description": "Что такое Git?",
          "Example": "",
          "Explanation": "Git - это компьютерное программное обеспечение, известное как система контроля версий. Это помогает людям отслеживать изменения в компьютерном коде или других текстовых файлах со временем.\n\nЭто похожа на историческую книгу для ваших файлов, позволяющую вам видеть, кто вносил изменения, какие изменения были внесены и когда они произошли."
        },
        {
          "StepNumber": 2,
          "Description": "Почему он используется?",
          "Example": "",
          "Explanation": "Git используется для облегчения работы над проектами с другими людьми. Это помогает нескольким людям взаимодействовать в одном и том же файле, не случайно перезаписывая работу друг друга.\n\nЭто также позволяет экспериментировать с новыми идеями, не беспокоясь о том, что вы уже сделали.\n\nКроме того, Git отлично подходит для сохранения резервных копий и управления различными версиями ваших файлов, так что вы всегда можете вернуться в предыдущее состояние при необходимости"
        },
        {
          "StepNumber": 3,
          "Description": "Installing Git",
          "Example": "git --version",
          "Explanation": "Перейдите на официальный Git сайт (https://git-scm.com/) и найдите раздел загрузки .\n\nВыберите версию Git, которая соответствует операционной системе вашего компьютера (например, Windows, macOS или Linux).\n\nПосле завершения загрузки откройте скачанный файл и следуйте инструкциям по установке.\n\nПосле установки вы можете проверить, установлен ли Git, открыв терминал или командную строку и набрав"
        },
        {
          "StepNumber": 4,
          "Description": "Настройка Git на вашем компьютере",
          "Example": "git config --global user.name 'Your Name'\ngit config --global user.email 'Your Email ID'",
          "Explanation": "Чтобы использовать Git, необходимо сначала настроить его на вашем компьютере, установив имя пользователя и адрес электронной почты. Эта информация будет прикреплена к каждому коммиту, который вы делаете в Git."
        },
        {
          "StepNumber": 5,
          "Description": "😕 Является ли Git и Github одинаковым?",
          "Example": "",
          "Explanation": "Нет, Git и GitHub не одинаковы, но они связаны с понятиями \n\nGit является базовой технологией, которая управляет версией управления локально.\n\nGitHub — это платформа, которая позволяет легко хранить, делиться и сотрудничать в репозиториях Git через интернет. Другие подобные платформы включают GitLab и Bitbucket."
        }
      ]
    },
    {
      "LessonTitle": "Основы Git",
      "Steps": [
        {
          "StepNumber": 1,
          "Description": "Инициализация проекта",
          "Example": "git init",
          "Explanation": "После установки Git первым шагом является настройка контроля версий для вашего проекта.\n\nОткройте терминал командной строки или Git Bash (если вы в Windows) и перейдите в каталог, где вы хотите запустить ваш проект.\n\nИспользуйте следующую команду для инициализации нового Git-репозитория"
        },
        {
          "StepNumber": 2,
          "Description": "Создание файлов и добавление текста",
          "Example": "Здравствуйте, это мой первый файл",
          "Explanation": "Вы можете использовать любой текстовый редактор, который вы предпочитаете, например, блокнот,Vim,Sublime или Visual Studio Code\n\nСоздайте новый файл 'привет. xt' и затем записать следующий текст и сохранить файл"
        },
        {
          "StepNumber": 3,
          "Description": "Добавление и отслеживание файлов",
          "Example": "git add hello.txt",
          "Explanation": "Как только вы создаете и редактируете файл, пришло время начать отслеживать его с помощью Git.\n\nДля этого используйте команду git add <file name>."
        },
        {
          "StepNumber": 4,
          "Description": "Проверка статуса",
          "Example": "git status",
          "Explanation": "В любой момент вы можете проверить статус вашего репозитория, чтобы увидеть, какие файлы отслеживаются, изменяются или поставлены для следующего коммита.\n\nКоманда git status' предоставляет вам эту информацию."
        },
        {
          "StepNumber": 5,
          "Description": "Создание коммитов",
          "Example": "git commit -m \"мои первые коммиты\"",
          "Explanation": "Зафиксировать Git представляет собой снимок вашего проекта в определенный момент времени.\n\nЭто способ записать ваши изменения и дать реальное описание того, что вы сделали.\n\nДля фиксации вы используете следующую команду"
        },
        {
          "StepNumber": 6,
          "Description": "Что дальше?",
          "Example": "",
          "Explanation": "🎉 Поздравляем! Вы покрыли основы Git.\n\nКак только вы продолжите свое путешествие с Git, вы узнаете больше о ветке, слиянии и т.д.\n\nИ не забывайте, что документация по Git и онлайн-учебники являются отличными ресурсами для углубления вашего понимания."
        }
      ]
    },
    {
      "LessonTitle": "Git ветки",
      "Steps": [
        {
          "StepNumber": 1,
          "Description": "Что такое Git Филиал?",
          "Example": "",
          "Explanation": "Ветка Git - это отдельная линия разработки, позволяющая работать с различными частями вашего проекта, не затрагивая основной кодовой базы.\n\nЭто особенно полезно для совместной работы и управления множественными функциями, исправления ошибок или эксперименты одновременно.\n\nВетки помогают изолировать изменения, облегчая проверку и интеграцию их в базовую кодовую базу."
        },
        {
          "StepNumber": 2,
          "Description": "Создание ветки",
          "Example": "git branch feature-login",
          "Explanation": "Чтобы создать новую ветку, используйте команду `git branch`, а затем название ветки, которую вы хотите создать."
        },
        {
          "StepNumber": 3,
          "Description": "Переключение ветки",
          "Example": "git checkout feature-login",
          "Explanation": "Чтобы переключиться на новую ветку, используйте команду `git checkout` или `git switch` с именем ветки."
        },
        {
          "StepNumber": 4,
          "Description": "[Shortcut] Создание и Переключение ветки",
          "Example": "git checkout -b feature-signup",
          "Explanation": "Чтобы создать и переключиться на новую ветку в одной команде, используйте `git checkout -b <branch-name>`."
        },
        {
          "StepNumber": 5,
          "Description": "Объединение ветки",
          "Example": "git checkout main\ngit merge feature-login",
          "Explanation": "Как только вы удовлетворены изменениями, сделанными в вашей ветке, пришло время объединить эти изменения обратно в основную базу кода.\n\nДля этого переключитесь на главную / главную ветку и используйте команду `git merge`."
        },
        {
          "StepNumber": 6,
          "Description": "Удаление ветки",
          "Example": "git branch -d feature-login",
          "Explanation": "Убедитесь, что вы объединили все изменения из ветки, которую вы хотите удалить, перед запуском этой команды.\n\nДля удаления ветки, используйте команду `git branch` после опции `-d` .\n\nЕсли вам нужно принудительно удалить ветку, используйте флаг `-D` вместо `-d`."
        }
      ]
    },
    {
      "LessonTitle": "Постановка Git",
      "Steps": [
        {
          "StepNumber": 1,
          "Description": "Что такое Git отладки",
          "Example": "",
          "Explanation": "Git staging - это процесс подготовки набора изменений, которые должны быть сделаны в Git репозиторий.\n\nЭто позволяет выбрать только изменения, которые вы хотите включить в следующий коммит, вместо того, чтобы вносить все изменения, внесенные в репозиторий."
        },
        {
          "StepNumber": 2,
          "Description": "Добавление изменений в область разбивки Git",
          "Example": "git добавить file1.txt file2.txt",
          "Explanation": "Чтобы добавить изменения в Git Staging Area, используйте команду `git add` с именами файлов, которые вы хотите добавить.\n\nЭто сделает этап изменений, что означает, что они будут включены в следующий коммит."
        },
        {
          "StepNumber": 3,
          "Description": "Просмотр этапов и непредвиденных изменений",
          "Example": "diff git\ngit diff --staged",
          "Explanation": "Для просмотра изменений, внесенных в Git репозиторий, используйте команду `git diff`.\n\nЧтобы просмотреть только сделанные изменения, используйте команду `git diff --staged`. Отображается список изменений, которые были спланированы и готовы к исполнению."
        },
        {
          "StepNumber": 4,
          "Description": "Удаление изменений из промежуточной зоны",
          "Example": "git reset file1.txt",
          "Explanation": "Чтобы удалить изменения из Git Staging Area, используйте команду `git reset`, а затем имя файла, который вы хотите удалить.\n\nЭто удалит изменения из промежуточной области, но они все еще будут существовать в рабочем дереве."
        },
        {
          "StepNumber": 5,
          "Description": "Фиксация изменений",
          "Example": "git commit -m 'Сообщение коммита'",
          "Explanation": "Чтобы зафиксировать изменения в Git Staging Area в Git repository, используйте команду `git commit` после сообщения коммита.\n\nЭто создаст новый коммит в журнале Git с изменениями, которые вы отредактировали."
        }
      ]
    },
    {
      "LessonTitle": "GitHub",
      "Steps": [
        {
          "StepNumber": 1,
          "Description": "Что такое GitHub?",
          "Example": "",
          "Explanation": "GitHub — это веб-платформа для управления версиями и взаимодействия с Git.\n\nЭто обеспечивает централизованный репозиторий для проектов, что облегчает взаимодействие команд по коду и отслеживанию изменений."
        },
        {
          "StepNumber": 2,
          "Description": "Создание учетной записи GitHub",
          "Example": "",
          "Explanation": "Чтобы начать использовать GitHub, вам нужно создать учетную запись GitHub, посетив веб-сайт GitHub и следуя за процессом регистрации. Вам будет предложено указать имя пользователя, адрес электронной почты и пароль."
        },
        {
          "StepNumber": 3,
          "Description": "Создание нового репозитория GitHub",
          "Example": "",
          "Explanation": "1. Log in to your GitHub account.\n\n2. Click the \"+\" icon in the top-right corner and select \"New repository\"\n\n3. Provide a name for your repository, a brief description, and choose whether it's public (visible to anyone) or private (visible only to collaborators)\n\n4. Select additional options if needed, such as initializing the repository with a README file\n\n5. Click \"Create repository\""
        },
        {
          "StepNumber": 4,
          "Description": "Клонирование GitHub репозитория",
          "Example": "git clone <repository_link>",
          "Explanation": "Клонирование репозитория означает копирование его содержимого на локальную машину.\n\nЭто позволяет вносить изменения, отслеживать их Git и отправлять эти изменения обратно в репозиторий.\n\nЧтобы скопировать GitHub репозиторий на локальную машину, используйте команду `git clone` с URL-адресом репозитория GitHub.\n\n Для примера: \"git clone https://github.com/firstcontributions/first-contributions.git\""
        },
        {
          "StepNumber": 5,
          "Description": "Создание изменений и отправка на GitHub",
          "Example": "git add .\ngit commit -m \"message\"\n\ngit push main",
          "Explanation": "После клонирования репозитория, вы можете вносить изменения в файлы так же, как и в любом другом Git репозитории.\n\nПосле внесения изменений выполните следующие шаги, чтобы отправить свои изменения на GitHub.\n\nЗатем используйте команду `git push` после названия ветки, в которую вы хотите внести изменения. Это загрузит изменения в GitHub."
        }
      ]
    },
    {
      "LessonTitle": "Git to GitHub Workflow using Terminal",
      "Steps": [
        {
          "StepNumber": 1,
          "Description": "Создание нового Git-репозитория локально",
          "Example": "git init my-new-project",
          "Explanation": "Чтобы начать использовать Git для нового проекта, необходимо создать Git репозиторий. Вы можете сделать это, перейдя в директорию проекта в терминале и запустив команду `git init`."
        },
        {
          "StepNumber": 2,
          "Description": "Добавление файлов в Git-репозиторий",
          "Example": "git add .\ngit commit -m 'Initial commit'",
          "Explanation": "Чтобы добавить файлы в Git репозиторий, используйте команду `git add` после имени файла или `. , чтобы добавить все файлы в каталог. Затем используйте команду `git commit` для создания нового коммита с сообщением, описывающим внесенные изменения."
        },
        {
          "StepNumber": 3,
          "Description": "Создание нового GitHub репозитория",
          "Example": "",
          "Explanation": "Чтобы создать новый репозиторий GitHub, войдите в вашу учетную запись на GitHub и нажмите кнопку «Новый репозиторий». Вам будет предложено предоставить имя репозитория, описание и выбрать видимость репозитория (публичная или частная)."
        },
        {
          "StepNumber": 4,
          "Description": "Добавление GitHub репозитория в качестве пульта",
          "Example": "git remote add origin https://github.com/user/repo.git",
          "Explanation": "Чтобы связать локальный Git-репозиторий с GitHub, вам нужно добавить GitHub репозиторий в Git. Вы можете сделать это, используя команду `git remote add` после имени вы хотите дать пульт (обычно `origin`) и URL-адрес репозитория GitHub."
        },
        {
          "StepNumber": 5,
          "Description": "Отправка изменений в GitHub репозиторий",
          "Example": "git push -u origin master",
          "Explanation": "Для переноса изменений в локальный Git репозиторий в GitHub репозиторий, используйте команду `git push` после имени пульта (`origin`) и ветки, на которую вы хотите нажать изменения (`master`). Параметр `-u` устанавливает удаленную и ветку по умолчанию для будущих команд `git push`."
        }
      ]
    }
  ]
}